<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for the latest version of Foxit PDF Reader.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.download.FoxitPDFReader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Foxit PDF Reader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.foxit.com/pdf-reader/version-history.html</string>
				<key>re_pattern</key>
				<string>Version (\d+\.\d+\.\d+\.\d+)</string>
				<key>result_output_var_name</key>
				<string>latest_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.foxit.com/pdf-reader/version-history.html</string>
				<key>re_pattern</key>
				<string>Version (\d+)\.</string>
				<key>result_output_var_name</key>
				<string>MAJOR</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.foxit.com/pdf-reader/version-history.html</string>
				<key>re_pattern</key>
				<string>Version \d+\.(\d+)\.</string>
				<key>result_output_var_name</key>
				<string>MINOR</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cdn01.foxitsoftware.com/pub/foxit/phantomPDF/desktop/mac/%MAJOR%.x/%MAJOR%.%MINOR%/FoxitPDFReader%MAJOR%%MINOR%.L10N.Setup.pkg</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: FOXIT SOFTWARE INCORPORATED (8GN47HTP75)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted_pkg/</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/extracted_pkg/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted_pkg/%found_basename%/payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted_pkg/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/extracted_pkg/payload/Applications/*.app</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
