<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest LibreOffice with the given language. Set RELEASE to either 'Latest' or 'Previous' and ARCH to either 'x86_64' or 'aarch64'.

Please assign the appopriate LANGUAGE_CODE. This can be found by going to https://www.libreoffice.org/download/download-libreoffice, selecting "need another language",
and selecting the language. The LANGUAGE_CODE can be found at the end of the URL after 'lang='</string>
	<key>Identifier</key>
	<string>com.github.wycomco.download.LibreOfficeLangPack</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>LANGUAGE_CODE</key>
		<string>fr</string>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>RELEASE</key>
		<string>Latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_var</key>
				<string>%pathname%</string>
				<key>rename_var</key>
				<string>pathname_app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>.dmg</string>
				<key>input_string</key>
				<string>%url%</string>
				<key>replace</key>
				<string>_langpack_%LANGUAGE_CODE%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix-recipes.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_langpack_%LANGUAGE_CODE%.dmg</string>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
