<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest LibreOffice with the given language. Set RELEASE to either 'Latest' or 'Previous' and ARCH to either 'x86_64' or 'aarch64'.

Please assign the appopriate LANGUAGE_CODE. This can be found by going to https://www.libreoffice.org/download/download-libreoffice, selecting "need another language",
and selecting the language. The LANGUAGE_CODE can be found at the end of the URL after 'lang='</string>
	<key>Identifier</key>
	<string>com.github.wycomco.download.LibreOfficeLangPack</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>LANGUAGE_CODE</key>
		<string>fr</string>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>RELEASE</key>
		<string>Latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_var</key>
				<string>%pathname%</string>
				<key>rename_var</key>
				<string>pathname_app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%url%</string>
				<key>pattern_replace</key>
				<array>
					<dict>
						<key>pattern</key>
						<string>.dmg</string>
						<key>repl</key>
						<string>_langpack_%LANGUAGE_CODE%.dmg</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_langpack_%LANGUAGE_CODE%.dmg</string>
				<key>url</key>
				<string>%parsed_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>Use wildcard matching for the app so it will also match FirefoxDeveloperEdition.app and FirefoxNightly.app</string>
                <key>input_path</key>
                <string>%pathname%/LibreOffice Language Pack.app</string>
                <key>requirement</key>
                <string>identifier "org.libreoffice.script.langpack" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"</string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
