<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Instead of the official version number, the ShortVersionString is used for the application version for consistency.</string>
	<key>Description</key>
	<string>Downloads, repackages the latest version of Clip Studio Paint and imports it into Munki. The language can be selected by setting the LANGUAGE variable to german, english, spanish, or french, japanese, korean, or chinese_tc.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.ClipStudioPaint</string>
	<key>Input</key>
	<dict>
		<key>APP_LOCATION</key>
		<string>/Applications/CLIP STUDIO 1.5/App/CLIP STUDIO PAINT.app</string>
		<key>LANGUAGE</key>
		<string>english</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ClipStudioPaint</string>
		<key>PKG_NAME</key>
		<string>%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>CLIP STUDIO PAINT.app</string>
				<string>CLIP STUDIO.app</string>
				<string>AggregateMdul.app</string>
				<string>CertMdul.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Graphics and Design</string>
			<key>description</key>
			<string>Clip Studio Paint is a versatile digital painting program that is ideal for rendering and inking with its many useful and unique features.</string>
			<key>developer</key>
			<string>Celsys</string>
			<key>display_name</key>
			<string>Clip Studio Paint</string>
			<key>minimum_os_version</key>
			<string>10.13.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.pkg.ClipStudioPaint</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The download URL points to an outdated version and will soon be removed. Please remove it from your list of recipes.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>path</key>
							<string>%APP_LOCATION%</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%PKG_NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
