<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft's OneNote for Office 365 installer package and renames the package.
    This recipe is a fork of com.github.rtrouton.pkg.microsoftonenote365 and supports gathering of useful meta data from
    the app bundle.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.pkg.microsoftonenote365</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft OneNote</string>
		<key>SOFTWARETITLE</key>
		<string>OneNote</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>VERSIONTYPE</key>
		<string>CFBundleVersion</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.microsoftonenote365</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/unpack/*OneNote*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%found_filename%/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Microsoft OneNote.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>%VERSIONTYPE%</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Microsoft OneNote.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_os_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Microsoft OneNote.app</string>
				</array>
				<key>version_comparison_key</key>
				<string>%VERSIONTYPE%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
					<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
