<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Teams installer package, appends the version to the end of the filename, creates a proper installs array and imports into Munki.
    This recipe is a fork of com.github.autopkg.munki.MSTeams.
    You may also want to change the attributeSetting for com.microsoft.autoupdate in installer_choices_xml to "0"
    to prevent Microsoft's own updater to be installed (line 63 in this recipe).</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.MSTeams2</string>
	<key>Input</key>
	<dict>
		<key>CHANNEL</key>
		<string>Production</string>
		<key>LOCALE_ID</key>
		<string>1033</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/msoffice</string>
		<key>NAME</key>
		<string>MSTeams</string>
		<key>PRODUCT</key>
		<string>Teams2</string>
		<key>MUNKI_CATEGORY</key>
		<string>Social Media</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>munki_required_update_name</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Teams</string>
				<string>Microsoft Teams (work or school)</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft AutoUpdate</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Microsoft Teams is the new chat-centered workspace in Office 365. Keep all your content, tools, people, and conversations together in one place.</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Teams</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.teams2</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.autoupdate</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.MSTeams2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MSOfficeMacURLandUpdateInfoProvider</key>
			<dict>
				<key>git_hash</key>
				<string>a00457ad6d835f4d7bb5a256cc2b280607269134</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacURLandUpdateInfoProvider.py</string>
				<key>sha256_hash</key>
				<string>54997072c0e3720d09b8fb4f002e18af8e57e9841c9363201e931a6914f13080</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.MSOfficeMacProduct</key>
			<dict>
				<key>git_hash</key>
				<string>db02edcc4fad1325e3f44ea31aa387a4ad39c998</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacProduct.download.recipe</string>
				<key>sha256_hash</key>
				<string>c7f9b0fa0e3634c0aab69e3248da0dca823e0749304a70c45272bbcb9db84df8</string>
			</dict>
			<key>com.github.autopkg.download.MSTeams2</key>
			<dict>
				<key>git_hash</key>
				<string>a635a1d811c437f8c050995f2b29dedd2b5c8c3d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSTeams2.download.recipe</string>
				<key>sha256_hash</key>
				<string>00c49b22f492017eb11d835dfad2456001494238b49fdb47256ac8633bfb6b70</string>
			</dict>
			<key>com.github.autopkg.munki.MSTeams2</key>
			<dict>
				<key>git_hash</key>
				<string>1c73252ecbaa7ec9dc47b41210d2b69062ee2d22</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSTeams2.munki.recipe</string>
				<key>sha256_hash</key>
				<string>97cafc6a96131afb716fadb75aaf16c911a01840c9c7b962020e968cae75e3ec</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
