<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of airprint_ppd and imports it into Munki. The language can be selected by setting the LANGUAGE variable to german, english, spanish, or french, japanese, korean, or chinese_tc.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.airprint-ppd</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>airprint_ppd</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>This utility fetches drivers and icons for AirPrint printers without user interaction.</string>
			<key>developer</key>
			<string>wycomco</string>
			<key>display_name</key>
			<string>airprint-ppd</string>
			<key>minimum_os_version</key>
			<string>10.15.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.download.airprint-ppd</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_unpacked/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_extracted</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>installs_item_paths</key>
				<array>
					<string>/usr/local/wycomco/airprint-ppd/airprint-ppd.zsh</string>
				</array>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_extracted</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%_extracted</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
