<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest update build of ARCHICAD based on the override-able parameters: MAJOR_VERSION, LOCALIZATION, and RELEASE_TYPE

MAJOR_VERSION options include:  20, 21, 22, 23, 24, 25 and 26
LOCALIZATION options include:  INT (international english, part of many other licenses), AUS, AUT, BRA, CHE, CHI, CZE, FIN, FRA, GER, GRE, HUN, ITA, JPN, KOR, NED, NOR, NZE, POL, POR, RUS, SPA, SWE, TAI, TUR, UKI, UKR, and USA
RELEASE_TYPE options include:  FULL (for full version), AC (full versions for older majors), SOLO, and START
ARCHITECTURE:  INTEL or ARM, falls back to INTEL</string>
	<key>Identifier</key>
	<string>com.github.wycomco.download.ARCHICADUpdate</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>INTEL</string>
		<key>LOCALIZATION</key>
		<string>INT</string>
		<key>MAJOR_VERSION</key>
		<string>26</string>
		<key>NAME</key>
		<string>ARCHICAD%MAJOR_VERSION%_%LOCALIZATION%_update</string>
		<key>RELEASE_TYPE</key>
		<string>FULL</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>localization</key>
				<string>%LOCALIZATION%</string>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
				<key>release_type</key>
				<string>%RELEASE_TYPE%</string>
			</dict>
			<key>Processor</key>
			<string>ARCHICADUpdatesProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%_%ARCHITECTURE%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>(identifier "com.graphisoft.GSLauncher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3E9E9FN277") or (identifier "com.graphisoft.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3E9E9FN277")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
