<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Re-DMGs Unclack.app in a read only DMG.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.dmg.Unclack</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.download.Unclack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/dmg_root/Unclack.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/Unclack.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/unclack.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/dmg_root</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
	</array>
</dict>
</plist>
