<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Remote Desktop installer package for Office 365 and imports into Munki.
    This recipe is a fork of com.github.foigus.munki.microsoftremotedesktop and supports the automatic identification
    of the minimum_os_version and creates a proper installs array.
    You may also want to change the attributeSetting for com.microsoft.package.Microsoft_AutoUpdate.app in
    installer_choices_xml to "0" to prevent Microsoft's own updater to be installed (line 47 in this recipe).</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.microsoftremotedesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/msoffice</string>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft AutoUpdate</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Remote Desktop</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Use the new Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.rdc.macos</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.autoupdate</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.pkg.microsoftremotedesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Since Microsoft has replaced the Microsoft Remote Desktop app with the new Windows App, this recipe is now non-functional. Please replace its references in your recipes with the new recipe "com.github.wycomco.munki.windowsapp".</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Microsoft Remote Desktop.app</string>
				</array>
				<key>version_comparison_key</key>
				<string>%VERSIONTYPE%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>minimum_os_version</key>
					<string>%minimum_os_version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
