<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft's Remote Desktop installer package and renames the package.
    This recipe is a fork of com.github.rtrouton.pkg.microsoftremotedesktop and supports gathering of useful meta
    data from the app bundle.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.pkg.microsoftremotedesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>SOFTWARETITLE</key>
		<string>Remote</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>VERSIONTYPE</key>
		<string>CFBundleShortVersionString</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.microsoftremotedesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Since Microsoft has replaced the Microsoft Remote Desktop app with the new Windows App, this recipe is now non-functional. Please replace its references in your recipes with the new recipe "com.github.wycomco.pkg.windowsapp".</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/unpack/*rdc.macos*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%found_filename%/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Microsoft Remote Desktop.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>%VERSIONTYPE%</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Microsoft Remote Desktop.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_os_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
