<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome disk image and imports into Munki. Override NAME and BUILD to your own preferences but be aware that BUILD will be attached to the downloaded filename in the parent recipe (com.github.rtrouton.download.googlechromeuniversal).</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.googlechromeuniversal</string>
	<key>Input</key>
	<dict>
		<key>BUILD</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>app_googlechrome_universal</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.googlechromeuniversal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>DeprecationWarning</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is deprecated and will not be fixed, updated or maintained in any way. Please use GoogleChrome from the autopkg/recipes repo. This recipe will be removed on 01.02.2021.</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
